In [1]:
#階層式索引
import numpy as np
import pandas as pd
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 2, 3, 1, 2, 3]])
data

a  1    0.094127
   2    0.269784
   3    2.088533
b  1    0.008400
   2    0.464067
c  3   -0.981537
   1   -1.538346
d  2   -0.823106
   3    0.184817
dtype: float64

In [2]:
data['d']

2   -0.823106
3    0.184817
dtype: float64

In [3]:
data['b':'c']

b  1    0.008400
   2    0.464067
c  3   -0.981537
   1   -1.538346
dtype: float64

In [4]:
#loc[外部標籤,內部標籤]
data.loc[:,2]

a    0.269784
b    0.464067
d   -0.823106
dtype: float64

In [5]:
data

a  1    0.094127
   2    0.269784
   3    2.088533
b  1    0.008400
   2    0.464067
c  3   -0.981537
   1   -1.538346
d  2   -0.823106
   3    0.184817
dtype: float64

In [13]:
newDataFrame=data.unstack().fillna(0)
newDataFrame

          1         2         3
a  0.094127  0.269784  2.088533
b  0.008400  0.464067  0.000000
c -1.538346  0.000000 -0.981537
d  0.000000 -0.823106  0.184817

In [12]:
newDataFrame.stack()

a  1    0.094127
   2    0.269784
   3    2.088533
b  1    0.008400
   2    0.464067
   3    0.000000
c  1   -1.538346
   2    0.000000
   3   -0.981537
d  1    0.000000
   2   -0.823106
   3    0.184817
dtype: float64

In [15]:
#DataFrame使用多階層索引
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a','a','b','b'],[1, 2, 1, 2]],
                    columns=[['台北','台北','台中'],['Green','Red','Green']])
frame

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [17]:
#階層式的索引可以命名,使用names,指定值使用list
frame.index.names = ['key1', 'key2']
frame.columns.names = ['縣市','顏色']
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [18]:
frame['台北']

顏色         Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [20]:
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [21]:
frame.sum(level='key1')

縣市      台北        台中
顏色   Green Red Green
key1
a        3   5     7
b       15  17    19

In [22]:
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [23]:
frame.sum(level='顏色',axis=1)

顏色         Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [24]:
#將DataFrame的欄位變為索引

frame = pd.DataFrame({'a':range(7), 'b':range(7, 0, -1),
                     'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [30]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [ ]:
#欄位變為索引